{"reviewerID": "A13R0XX727WQB8", "asin": "7799813393", "reviewerName": "bb", "helpful": [0, 0], "reviewText": "Bought this to transfer video from some old equipment. (Sony CCD-TRV308 Hi8 videocam and Panasonic Omnivision VHS cassette player.) It's not fancy but does the job. I prefer to use PotPlayer to capture/convert the video over the included software which works ok. I'm satisfied with this purchase.", "overall": 3.0, "summary": "Good for what it can do.", "unixReviewTime": 1358380800, "reviewTime": "01 17, 2013"}
{"reviewerID": "A1H9UFWNIWTPFV", "asin": "7799813393", "reviewerName": "Charles S Salmons", "helpful": [0, 0], "reviewText": "I have been using this alot, converting old video tapes, VHS, and tv into online videos. Anything you can play on your vcr, from tapes or tv, it can record.", "overall": 5.0, "summary": "I use this alot", "unixReviewTime": 1362700800, "reviewTime": "03 8, 2013"}
{"reviewerID": "A2D1N6Z7WS9AQQ", "asin": "7799813393", "reviewerName": "chris", "helpful": [1, 2], "reviewText": "The EZGrabber2 works well but it's software is a little lack luster. I have software installed on my computer that works properly with my night vision so the EZgrabber works well to do what I needed.", "overall": 4.0, "summary": "works well", "unixReviewTime": 1346716800, "reviewTime": "09 4, 2012"}
{"reviewerID": "AO5O459IFGVTG", "asin": "7799813393", "reviewerName": "Jose A. Mendez", "helpful": [0, 0], "reviewText": "I bought it to create dvds from home vhs video. Had to upgrade my pc to a faster cpu to avoid jittery recording. After that it work as described. Delivery was fast.", "overall": 4.0, "summary": "works but needs a fast pc", "unixReviewTime": 1365552000, "reviewTime": "04 10, 2013"}
{"reviewerID": "A3BOQADZVJB6C3", "asin": "7799813393", "reviewerName": "Kypros Nighthawk", "helpful": [6, 7], "reviewText": "I got this because it was pretty decently priced, honestly though seeing how some of the other video capture devices out there were upwards of $60 I wasn't expecting much.  When I got, I was rather surprised how well it worked.  While it's plug 'n play, I decided to forgo the install CD and just downloaded the drivers directly from the manufacturer's website.  While the video is decent quality, it still retains some grainyness after burning the video to a DVD, the quality of the original played on a VCR is still better quality than what you capture and burn to a DVD.  That being said, it's not all that bad, really.  But since I only needed to copy a few home videos that we made from an old VHS-C camcorder it wasn't really worth it.I found that the best way to get the best quality was to adjust the video settings manually (add a little more saturation, and sharpness), and use the \"DVD\" format for capture, that were there is minimal second encoding required when you burn to a disc (I use windows DVD maker, because I'm cheap :B)The nice thing is it also includes an S-video option, unfortunately my VCR only allows S-video with 480p signals (ie DVD movies and restricts VCR video to 480i.  The DVD capture format seems to add some deinterlacing to the captured video from what I can tell (though it might just be my video card doing it)  Still, it's a pretty good buy for someone who wants to archive or even send family members burned DVDs of videos.", "overall": 4.0, "summary": "Cheap and it works", "unixReviewTime": 1346025600, "reviewTime": "08 27, 2012"}
{"reviewerID": "A39VG5STMCQBI", "asin": "7799813393", "reviewerName": "Paul T. Johnson \"funktronatron\"", "helpful": [1, 4], "reviewText": "A little background...I am a 38 year old man who has played around with electronics and computers my entire life. Windows 7-64bit machine with 8GB RAM blah,blah,blah.I have struggled well over a month with this piece of trash. After this experience I'm DONE with Micro$oft's depending on consumers to fix there crap OS and heading to Costco to let other computers do what this device clearly will not.", "overall": 1.0, "summary": "WARNING! Frustrating and Discouraging experience awaits you!", "unixReviewTime": 1352592000, "reviewTime": "11 11, 2012"}
