{"reviewerID": "A2EQDEKD20ZLGD", "asin": "3930992868", "reviewerName": "Daniel T Johnson", "helpful": [0, 0], "reviewText": "brought back my IPOD video 30G back life, easy to replace.  Only hard part is to get the case opened.", "overall": 5.0, "summary": "HardDrive", "unixReviewTime": 1370390400, "reviewTime": "06 5, 2013"}
{"reviewerID": "A172O6GT6GLUIB", "asin": "3930992868", "reviewerName": "gandhi", "helpful": [0, 0], "reviewText": "Awesome replacement for an ipod video 5th gen 30gb hard drive, saved me the cost of buying a brand new iPod.", "overall": 5.0, "summary": "good, cheap replacement", "unixReviewTime": 1314662400, "reviewTime": "08 30, 2011"}
{"reviewerID": "A22966W52J34CH", "asin": "3930992868", "reviewerName": "Jorge Acosta", "helpful": [0, 0], "reviewText": "THIS ARTICLE WITH ALL MY EXPECTATIONS FULFILLED RECOMMEND IT BECAUSE THE PACKAGING AND JURISDICTION ENTRAG CORRECT, IN ADDITION TO RUN FERFECION", "overall": 5.0, "summary": "VERY NICE ITEM", "unixReviewTime": 1397692800, "reviewTime": "04 17, 2014"}
{"reviewerID": "AOHG53ZO6BJ7R", "asin": "3930992868", "reviewerName": "Joseph A. Bordage \"Joe\"", "helpful": [2, 2], "reviewText": "A very easy replacement for a 5th gen ipod 30G HD.  I purchased the ipod on ebay knowing it was damaged.  It had the \"sad ipod face\" screen of death.  I could hear the HD trying to spin up, but not reading properly.  If you have that indication, all you need is this HD!The repair was easy.  Carefully pry apart the ipod with a small flat screwdriver and remove the smaller connector.  The ipod can now be placed on a table with both pieces open.  Next, remove the bad HD by unplugging the ribbon cable ON THE HD SIDE.  Make sure to note the orientation of the HD as it will only work one way...easy to put the replacement HD in \"backwards\".  Replace with the new HD.  The only trouble I had was the cable would not stay in the HD for some reason.  I had to use a piece of tape to secure the cable to the HD so it wouldn't come out.  Next, using a small pair of needle-nose pliers, grip the small ribbon cable gently, and push it back into it's slot.  Finally, carefully hold the HD in place and re-attach the two ipod pieces.Now you will have to restore to factory settings.  There are resources on the net for this...I just started up iTunes and plugged in the ipod.  After a few min. iTunes reconized that the ipod needed to be restored.Good luck!", "overall": 5.0, "summary": "Replaced 30G ipod HD", "unixReviewTime": 1312243200, "reviewTime": "08 2, 2011"}
{"reviewerID": "A2PC1YCLTB3EY9", "asin": "3930992868", "reviewerName": "Sanjay K. Aiyagari", "helpful": [0, 0], "reviewText": "My iPod video had hard drive failure.  I used iFixit instructions and this drive to make it work.Make sure you plug the cable in the right way.  Drive is shielded on both sides unlike the original so you have to look carefully.  If you get it wrong, iPod will tell you there is battery failure, but there isn't, it's just the drive in backwards.  I flipped it around and it worked, no harm done.", "overall": 5.0, "summary": "Great replacement for iPod Video hard drive", "unixReviewTime": 1377043200, "reviewTime": "08 21, 2013"}
{"reviewerID": "A5RESRBCJXMOM", "asin": "3930992868", "reviewerName": "Sean", "helpful": [0, 0], "reviewText": "Not much to say.  Dropped right into my Zune in place of the original drive.The cable release tab is extremely fragile, but the drive works just fine even though I broke the tab.. oops!", "overall": 5.0, "summary": "Works great", "unixReviewTime": 1291161600, "reviewTime": "12 1, 2010"}
{"reviewerID": "A10G7GOD9ZWVVV", "asin": "3930992868", "reviewerName": "ward b. waldo", "helpful": [0, 0], "reviewText": "My daughter's 30GB Ipod Classic needed a new Hard Drive and this worked great...about 5 minutes to install, plug in to Itunes and it set up by itself.", "overall": 5.0, "summary": "Ipod Replacement", "unixReviewTime": 1396915200, "reviewTime": "04 8, 2014"}
