{"reviewerID": "ABB3GDPNS9TVW", "asin": "998498480X", "reviewerName": "Anna Marie Brenneman \"Daylily Lady\"", "helpful": [0, 0], "reviewText": "The charger that came with my Garmin was no longer functioning so I was pleased to find this item.  It is worth buying.  It was packaged securely and arrived very quickly.", "overall": 5.0, "summary": "Love this charger.", "unixReviewTime": 1365292800, "reviewTime": "04 7, 2013"}
{"reviewerID": "A32NKAW0Q7A9IQ", "asin": "998498480X", "reviewerName": "ASHLEY", "helpful": [0, 1], "reviewText": "I got this charger along with a Garmin n&uuml;vi 855. The charger does what it says it does, and charges the GPS just fine. The only problem I have isn't really with the charger, but with the GPS. When the charging through the USB port like this charger does. The GPS stays powered on in \"USB Connected Mode\" the whole time. You can't turn it off, and so the screen, back-light, and maybe the GPS antenna are running while charging. Thus, increasing the time needed to charge.", "overall": 3.0, "summary": "Charger works great, but Garmin stays in USP conneted mode.", "unixReviewTime": 1290729600, "reviewTime": "11 26, 2010"}
{"reviewerID": "A1GPVV2XWNGSDX", "asin": "998498480X", "reviewerName": "C. J. G.", "helpful": [0, 0], "reviewText": "Garmin Nuvi 800 series Standard Red LED Wall / AC / Home Charger is a time and Battery Saver, also, the price was right.I needed it for a phone and GPS battery charger.So far it's a work horse and worth the money, if you needed it of coarse.", "overall": 5.0, "summary": "Time and Battery Saver", "unixReviewTime": 1303776000, "reviewTime": "04 26, 2011"}
{"reviewerID": "A1B48D0I1M9HBI", "asin": "998498480X", "reviewerName": "Gary", "helpful": [0, 0], "reviewText": "It worked perfectly. Nothing more that I could ask from a home charger. If you need one it will do the job.", "overall": 5.0, "summary": "Great", "unixReviewTime": 1388534400, "reviewTime": "01 1, 2014"}
{"reviewerID": "A1DOFBSJT3SSKZ", "asin": "998498480X", "reviewerName": "John Harris", "helpful": [4, 4], "reviewText": "It's a wall wart.  It's black.  It works.  It looks just like the ones for my pocket camera, iPod amp, cell phone... I'm going to have to start labeling these things.", "overall": 5.0, "summary": "What Can You Say...", "unixReviewTime": 1269561600, "reviewTime": "03 26, 2010"}
{"reviewerID": "A3R2M5ABAYL63P", "asin": "998498480X", "reviewerName": "Shikantaza \"Shikantaza\"", "helpful": [0, 0], "reviewText": "I used it once. Worked jus' real good.Can't find it now - it's probably with the 87 other AC adaptors I have because the idiots in the electronics industries can't agree on one or two standard charger voltages and connector shapes... grrrr....", "overall": 5.0, "summary": "I bought one of these? Where did it go?", "unixReviewTime": 1291507200, "reviewTime": "12 5, 2010"}
{"reviewerID": "A3RYHP2OYFJ3YC", "asin": "998498480X", "reviewerName": "The Sarcasticynic", "helpful": [0, 0], "reviewText": "The thing I liked best about this charger is that one can actually use the GPS while it is being charged.  As you probably know, when the Garmin is plugged into ones laptop via USB, it enters charge-only mode and you cannot use the device while it's being charged that way.  This unit enables one to charge the device in a hotel room without the need for a laptop and allows use in order to find an expensive Italian restaurant nearby.By the way, though the title says the LED is red, mine was actually blue (Horrors!)  That slight misrepresentation aside, I think this unit is well worth the investment.", "overall": 5.0, "summary": "Device can be used while plugged into charger!", "unixReviewTime": 1397779200, "reviewTime": "04 18, 2014"}
{"reviewerID": "A261321MIS0YPB", "asin": "998498480X", "reviewerName": "Thomas L. Callahan", "helpful": [0, 1], "reviewText": "I really don't have one of these wall chargers.  I did buy the accessory kit for the Garmin 260W, and use the USB cable attached to my desk top to charge my Nuvi - for what it's worth.  Also, I might mention that the Sandisk 2GB SD card I bought for my 260w may not serve to increase \"memory\" for GPS Garmin Nuvi functions.  The SD card will hold photos and recall them to display on the Nuvi, but I don't know that it will service \"routine\" GPS functions.  If anyone has, knows, or gets information about this, I would like to hear about it.I conveyed this info so that people won't buy stuff that they really don't need, and expect it to do what it won't do.", "overall": 4.0, "summary": "A/C charger for your Garmin?", "unixReviewTime": 1290729600, "reviewTime": "11 26, 2010"}
{"reviewerID": "A2U4W69NZJT4LD", "asin": "998498480X", "reviewerName": "William H. Cloose", "helpful": [2, 2], "reviewText": "It's difficult to write a specific review for this product.  It either works or it don't.  It works.  That's what I want it to do.", "overall": 5.0, "summary": "A/C Adapter", "unixReviewTime": 1273622400, "reviewTime": "05 12, 2010"}
