{"reviewerID": "A20XXTXWF2TCPY", "asin": "0972683275", "helpful": [0, 0], "reviewText": "This is a great buy, compared to a $60 or more a retail store.", "overall": 5.0, "summary": "Excelant mount for Tv. Would buy more if I needed them.", "unixReviewTime": 1405123200, "reviewTime": "07 12, 2014"}
{"reviewerID": "A2IDCSC6NVONIZ", "asin": "0972683275", "reviewerName": "2Cents!", "helpful": [1, 1], "reviewText": "This mount is just what I needed.  It is strong and sturdy.  It folds almost flat to enable the television to sit square and flat against the wall if desired and extends and rotates for angle turns.  A perfect fit as long as you match the correct visa pattern for your television.", "overall": 5.0, "summary": "Perfect", "unixReviewTime": 1367280000, "reviewTime": "04 30, 2013"}
{"reviewerID": "A1EDI0X3GI1SK7", "asin": "0972683275", "reviewerName": "AGW", "helpful": [0, 1], "reviewText": "Great deal, easy to mount and it appears to be fairly sturdy. I mounted a 32 in tv on it and it works great.", "overall": 5.0, "summary": "32 In TV Mount", "unixReviewTime": 1323993600, "reviewTime": "12 16, 2011"}
{"reviewerID": "A3BMUBUC1N77U8", "asin": "0972683275", "reviewerName": "ahoffoss", "helpful": [0, 0], "reviewText": "This mount works really well once you get it up and going.  Only problem is just the arms are a little goofy getting them all in the right spot.  But that's really not too big an issue considering all the different TV's and their mounting hole locations.", "overall": 4.0, "summary": "Pretty simple, but definitely good!", "unixReviewTime": 1385164800, "reviewTime": "11 23, 2013"}
{"reviewerID": "AVRFGGCCCR6QU", "asin": "0972683275", "reviewerName": "Alberto Dieguez \"premiere purchaser of random...", "helpful": [3, 4], "reviewText": "This wall mount does everything it's supposed to do.  The piece that attaches to the wall isn't overly long, which made it easier to mount the arm in the tight space I needed to mount it in.  The only issues I saw was that the joints were VERY tight initially and as we moved the arm around to install it, the joints loosened up to the point where I had to take the included allen wrench and tighten them up again.", "overall": 4.0, "summary": "Fairly good wall mount", "unixReviewTime": 1283126400, "reviewTime": "08 30, 2010"}
{"reviewerID": "A3UOSOCRKS3WIH", "asin": "0972683275", "reviewerName": "Allen Coberly", "helpful": [0, 0], "reviewText": "for the price you just cant beat this item. I bought it for a house I was selling so I could hang some tv and it worked great. Good quality for the price.", "overall": 5.0, "summary": "Cant Beat it!", "unixReviewTime": 1368316800, "reviewTime": "05 12, 2013"}
{"reviewerID": "A371ZZ95ZQEIZV", "asin": "0972683275", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "I received the mount, which was well packaged for shipping.  The installation instructions were Moderately clear.  No issues following them, they were just a little disjointed depending on the wall surface you were installing on.My shipment had a mis-cut piece, and was missing 4 screws.  I contacted the Manufacturer, and they shipped me a replacement part and screws the very next day (Shipped out of Texas, so normal mailing times applied)I like how the Mount fits together, and I easily mounted my 60lbs TV by myself.  The part that attaches to the TV has a hook that will hold the TV on the Arm till you bolt it on.It's very adjustable, and pushes almost flush with the wall.I'm very happy, but took one star for the miscut piece.", "overall": 4.0, "summary": "Sturdy Mount, good customer service", "unixReviewTime": 1389052800, "reviewTime": "01 7, 2014"}
{"reviewerID": "A7060R14RJF3I", "asin": "0972683275", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "Took a bit of work, but used this to fit an older vizio 32&#34; monitor to the wall to use as a compute monitor. Stable and like the ability to move the tv to different angles. The vizio was older and did not have the standard holes, this product fit and holds the tv very stable.", "overall": 4.0, "summary": "Works", "unixReviewTime": 1368835200, "reviewTime": "05 18, 2013"}
{"reviewerID": "A26QCCO0101CO1", "asin": "0972683275", "reviewerName": "Amazon Customer \"jkhinch\"", "helpful": [7, 9], "reviewText": "I used this for my 47&#34; Samsung. Its fit/feel is great. Easy installation. Appears strong; although I personally spent way too much on the tv to risk leaving it fully outstretched with too little lag bolts for a long time! It is very convenient to be able to move it away from the wall however and I would feel very comfortable tilt or swiveling if needed. The movement is fluid and easily adjustable.I am very pleased with my purchase.", "overall": 5.0, "summary": "Just what I'd hoped", "unixReviewTime": 1361404800, "reviewTime": "02 21, 2013"}
{"reviewerID": "APBF796U7GUTV", "asin": "0972683275", "reviewerName": "Amazon Customer \"steve-mc2\"", "helpful": [1, 1], "reviewText": "This item serves its purpose as well as any other mount.  Its most appealing attribute is its large range of motion.  I am using this to corner-mount a 32\" TV and it works perfectly to hide the mount, receptacles, and cables behind the TV.  Very easy installation as well.", "overall": 5.0, "summary": "Nice Mount", "unixReviewTime": 1331942400, "reviewTime": "03 17, 2012"}
{"reviewerID": "A2HLNXOYLMERTC", "asin": "0972683275", "reviewerName": "anthony smith", "helpful": [0, 0], "reviewText": "I love this mount.  This is the 4th one I've bought and it works great every time.  excellent seller and excellent product", "overall": 5.0, "summary": "Buy this mount its the best", "unixReviewTime": 1397606400, "reviewTime": "04 16, 2014"}
{"reviewerID": "A3CCITVF0WL6KE", "asin": "0972683275", "reviewerName": "A. Ramos", "helpful": [0, 0], "reviewText": "I am very glad for buying it.  It is heavy duty and good quality for the price.  It was very easy to install.", "overall": 5.0, "summary": "VideoSecu Swing Arm TV Wall Mount", "unixReviewTime": 1357689600, "reviewTime": "01 9, 2013"}
