{
  "reviewerID": "A35FPAMOA9XI55",
  "asin": "9573212900",
  "reviewerName": "David Milberg \"Radio Dave\"",
  "helpful": [
    15,
    16
  ],
  "reviewText": "I bought this to go with my new Acer Aspire One.  I also wanted an external burner that is lightweight and small.  This one worked immediately right out of the box and is everything it is decribed to be.  Fast service from the seller with several pre-and post-shipping alerts from the seller, too.  A real pleasure.",
  "overall": 5.0,
  "summary": "This unit rocks!",
  "unixReviewTime": 1254182400,
  "reviewTime": "09 29, 2009"
}
{
  "reviewerID": "A1ZDP5PMM6RTSO",
  "asin": "9573212900",
  "reviewerName": "Figmaglee",
  "helpful": [
    1,
    1
  ],
  "reviewText": "I couldn't use this drive with ACER's Aspire One eRecovery utility but have determined it is ACER's software problem, not a problem with the drive itself.  But what I learned in trying to get help from cBear was that (1) they can barely write English, (2) their first strategy is to send you all of the pre-written scripts that have nothing to do with your problem and, (3) if you persist, they will express doubt that there is a problem but will (grudgingly) agree to let you return the product.  I didn't need to do that because the drive works with software other that ACER's eRecovery but note that returns subtract 15% of the purchase price plus you pay for shipping.  I determined that the drive I received is an unlabeled OEM Toshiba drive and that's a respectable brand.",
  "overall": 4.0,
  "summary": "good product, strange tech support",
  "unixReviewTime": 1266624000,
  "reviewTime": "02 20, 2010"
}
{
  "reviewerID": "A10X9ME6R66JDX",
  "asin": "9573212900",
  "reviewerName": "Hugo M. M. Rabson",
  "helpful": [
    32,
    33
  ],
  "reviewText": "I needed an external CDRW/DVD drive for my Toshiba NB205.The Acer Aspire One USB External DVD/CDRW CD Burner suits my need perfectly. For my purposes, a drive has to read and write disks reliably and quietly; that's it. I don't need it to be especially fast or to look pretty. Fortunately, for me this external drive is quiet, unobtrusive, and reliable.It has one eccentricity that I've found. It comes with two USB cables - one for data, one for power - and so you might find yourself in the position of connecting two USB cables from your laptop to this device. I do think it's weird. I've never seen this before.I've had no technical problems of any kind with this device. I am thoroughly satisfied.",
  "overall": 4.0,
  "summary": "Quiet, unobtrusive, fully functional, slim; I love it",
  "unixReviewTime": 1250899200,
  "reviewTime": "08 22, 2009"
}
{
  "reviewerID": "A1RIVGXTRWO8EE",
  "asin": "9573212900",
  "reviewerName": "J. Martens",
  "helpful": [
    0,
    0
  ],
  "reviewText": "Not much to say here. Good value. Works as described. A little bigger than it needs to be, but does the job.",
  "overall": 4.0,
  "summary": "Good Value",
  "unixReviewTime": 1260576000,
  "reviewTime": "12 12, 2009"
}
{
  "reviewerID": "A11229C4LTJ4JG",
  "asin": "9573212900",
  "reviewerName": "Juan Sanchez",
  "helpful": [
    0,
    0
  ],
  "reviewText": "Tengo una Mini y no tiene unidad de disco, este producto ha sido de muchisima utilidad para la reproducci&oacute;n y grabacion en cds",
  "overall": 5.0,
  "summary": "Muy Util",
  "unixReviewTime": 1361318400,
  "reviewTime": "02 20, 2013"
}
{
  "reviewerID": "A1I43PYV1DMIIF",
  "asin": "9573212900",
  "reviewerName": "MandBinc \"MandBinc\"",
  "helpful": [
    0,
    0
  ],
  "reviewText": "I bought this because my COMPAQ DVD drive is not working too well. The External drive installed and seemed to do its stuff without any problems on WIN7. It comes with an extra USB cable to provide extra power to the drive if your primary USB port is not sufficient,On the ACER I use for streaming to my TV, it was just Plug in and use, no further installation was required, also a WIN7 machine.",
  "overall": 4.0,
  "summary": "Works well with ACERs and COMPAQs",
  "unixReviewTime": 1401494400,
  "reviewTime": "05 31, 2014"
}
{
  "reviewerID": "A18H6KCOM1IPDZ",
  "asin": "9573212900",
  "reviewerName": "PAS",
  "helpful": [
    1,
    2
  ],
  "reviewText": "The Acer Aspire Netbook is sold with Windows XP operating system.  This DVD/CD burner is sold with the Windows ME driver, a generation behind the XP.  I tried downloading an updated driver from Microsoft, no go.  I tried contacting cBear, hoping they would support their product, NOTHING!  $25 paperweight is now what I have.  Amazon should drop cBear as a re-seller.  (It's not Microsoft's job to support cBear's hardware, it's cBear's job to support their product.  Not even ansering my email is not acceptable.)",
  "overall": 1.0,
  "summary": "cBear Acer ASpireOne USB External DVD/CD-RW",
  "unixReviewTime": 1367712000,
  "reviewTime": "05 5, 2013"
}
{
  "reviewerID": "A21PY549E3M51S",
  "asin": "9573212900",
  "reviewerName": "RPQ",
  "helpful": [
    2,
    2
  ],
  "reviewText": "I bought this drive to go with my Netbook, since netbooks are too small for a drive with removable media. I based my decision on size, price, and the fact that you do not need to use two USB cables to power this up. This plays CD's and DVD's as well as any internal drive in a laptop. I can watch movies, play music and install software. No big deal to pack it with the Netbook and take it with you. Excellent product, would highly recommed.",
  "overall": 5.0,
  "summary": "Excellent external CD/DVD drive",
  "unixReviewTime": 1312761600,
  "reviewTime": "08 8, 2011"
}
{
  "reviewerID": "ACW97PWU2VO5D",
  "asin": "9573212900",
  "reviewerName": "T. Nelson",
  "helpful": [
    0,
    0
  ],
  "reviewText": "I have had this for a couple months. Used it to load Win7 on a Acer Netbook. Worked just great.",
  "overall": 5.0,
  "summary": "Unit Works Great",
  "unixReviewTime": 1388361600,
  "reviewTime": "12 30, 2013"
}
