{
  "reviewerID": "ARUQAU51OAMTQ",
  "asin": "9625993428",
  "reviewerName": "A. Jackson",
  "helpful": [
    0,
    0
  ],
  "reviewText": "I bought this for my iPod 2G. I wanted to take advantage of Skype calling my family. The mic itself is small, about as big as a horse pill or a paperclip to you youngins who don't know that a horse pill is any big a** pill you try to swallow...LOL I have a little pouch in my purse I keep it in so I don't lose it...because you will lose it. The sound was good when I recorded a voice memo. But you have to remove it to hear anything back. THAT's the kicker!It's a restriction of the device, not the mic. I thought I could use the mic to speak and my Bluetooth headphones to listen at the same time. No such luck. You have to get the iPod headphones with built in mic/recorder to do that. So all I can use this for is to record stuff and listen later. But it was cheap, so it's still a cool addition to my toys. Oh, and I also got the iPod headphones with mic... those too live in my little pouch of goodies...LOL",
  "overall": 5.0,
  "summary": "Pretty darn cool mic for iPod 2G",
  "unixReviewTime": 1316736000,
  "reviewTime": "09 23, 2011"
}
{
  "reviewerID": "ALKT8NT9YS9MR",
  "asin": "9625993428",
  "reviewerName": "ALK",
  "helpful": [
    1,
    2
  ],
  "reviewText": "Worked well for my older iPods, but it was purchased to enhance iPhone recording. However, there is no increased quality or functionality with the iPhone over the built in mic.",
  "overall": 3.0,
  "summary": "Okay for iPods, unnecessary for iPhone",
  "unixReviewTime": 1270771200,
  "reviewTime": "04 9, 2010"
}
{
  "reviewerID": "A288QFC30VQKN2",
  "asin": "9625993428",
  "reviewerName": "Amazon Customer",
  "helpful": [
    0,
    0
  ],
  "reviewText": "Works as advertised.  A bit large, so interferes with plugging in usb charge cord.  And, of course, with this plugged in it turns off the speakers.",
  "overall": 3.0,
  "summary": "Works fine",
  "unixReviewTime": 1363910400,
  "reviewTime": "03 22, 2013"
}
{
  "reviewerID": "A1ONY0WZAL2I3U",
  "asin": "9625993428",
  "reviewerName": "Amazon Customer \"Mar\"",
  "helpful": [
    1,
    1
  ],
  "reviewText": "This little microphone transforms my iPod into something much more useful for recording events.  There is no way to listen at the same time, but that was advertised as such.  Thank you.",
  "overall": 5.0,
  "summary": "Works Great",
  "unixReviewTime": 1335225600,
  "reviewTime": "04 24, 2012"
}
{
  "reviewerID": "A2462LPFBLFKT6",
  "asin": "9625993428",
  "reviewerName": "Anton Lemeza",
  "helpful": [
    18,
    19
  ],
  "reviewText": "I just got my mini mic and my Chill Pill Rapcap in the mail today.I bought both for my iPod Class 120gig for recording lectures. I didnt want to get one at a time to compare so I just bought both. My mini mic cost me $.34 and just under $4 shipping and rapcap was $14.50 and free shipping.I compared both for sound quality and distance at which they pick up sound. Turns out the only difference is the rapcap is white plastic spray painted pretty while the mini mic is either white or black plastic. Also the Rapcap is about .5mm smaller in diameter but same size in length. The caps construction is identical. Both work identical. Everything is the same. The only thing to test is durability but I'm confident it will be the same.So save the money and buy this one over the RapCap. They pick up sound great from a distance if you have it about 10 feet away from an instructor so just plug it in and stand it up near the instructors desk or sit near where he or she talks and youll be fine. I have a flip open case so I can plug mine in and stand it up so ill pick up sound great.Only complaint I have is that I bought the Rapcap too.",
  "overall": 5.0,
  "summary": "Identical to RapCap",
  "unixReviewTime": 1270684800,
  "reviewTime": "04 8, 2010"
}
{
  "reviewerID": "A1KGMLV9UME4EX",
  "asin": "9625993428",
  "reviewerName": "A. R. Kushmir \"Kush\"",
  "helpful": [
    0,
    0
  ],
  "reviewText": "When I wanted to use my iPod to record some reminders to myself I looked around for a compatible microphone expecting to pay $25 to $50 or more and having a twenty page instruction book to study, but then I found this little gem at a great price and no instruction book to study and it works like a charm for me, just plug it in and go. I wish all tech stuff could be this easy.",
  "overall": 5.0,
  "summary": "Simple, inexpensive, solutions",
  "unixReviewTime": 1280534400,
  "reviewTime": "07 31, 2010"
}
{
  "reviewerID": "A25KZDHFZKWC4V",
  "asin": "9625993428",
  "reviewerName": "BOBdotEXE",
  "helpful": [
    0,
    0
  ],
  "reviewText": "Ipod 5G/5.5G DO NOT SUPPORT LIN IN MICROPHONES!!!!!!DO NOT BUY UNLESS YOU HAVE A 6g 120GB",
  "overall": 1.0,
  "summary": "DOSE NOT WORK ON IPOD Video!!!!",
  "unixReviewTime": 1286755200,
  "reviewTime": "10 11, 2010"
}
{
  "reviewerID": "AM3N5LZ7BETCB",
  "asin": "9625993428",
  "reviewerName": "Bon Ochs",
  "helpful": [
    0,
    0
  ],
  "reviewText": "We received our order in three days which was super fast.  The microphone that we received is actually white but that is not an issue for us. We put it on our 5-6 year old I-pod touch that our son plays with so that he can play all of his talking animal games.  Despite reviews that stated it didn't work because the I-pod thinks there are headphones in, we have not had that issue with any of our talking games  with the exception of the talking Angela game.  I put the mic in and rebooted the I-pod and it worked perfectly.  I thought perhaps I would have to remove the case based on other reviews but there was no issue there either.  I was actually ready to take my I-pod to the Apple store and see if we could have a mic added but this $3.00 dollar microphone was the answer for us.",
  "overall": 5.0,
  "summary": "Updated our older I-pod touch",
  "unixReviewTime": 1361923200,
  "reviewTime": "02 27, 2013"
}
{
  "reviewerID": "A2U0ZD08F7EJ87",
  "asin": "9625993428",
  "reviewerName": "canada",
  "helpful": [
    0,
    0
  ],
  "reviewText": "I have a ipod touch i bought this item before i realized that my ipod already has a built in mic and so haven't used this mic and never needed it.",
  "overall": 3.0,
  "summary": "wrond item",
  "unixReviewTime": 1360454400,
  "reviewTime": "02 10, 2013"
}
{
  "reviewerID": "A9IP685WQXGQ2",
  "asin": "9625993428",
  "reviewerName": "chery",
  "helpful": [
    0,
    0
  ],
  "reviewText": "These work for the itouch 64gb but they sometimes skip when recording. You can not hear what you are recording. The sound quality is okay.. I did get this product fast through the mail.",
  "overall": 3.0,
  "summary": "Mini microphone",
  "unixReviewTime": 1310428800,
  "reviewTime": "07 12, 2011"
}
{
  "reviewerID": "A3RR3PDK3FX6CO",
  "asin": "9625993428",
  "reviewerName": "Chris",
  "helpful": [
    1,
    1
  ],
  "reviewText": "This products work for what i was using it for (an old iPod touch). I'm pleased but this is VERY easy to lose.",
  "overall": 5.0,
  "summary": "works well",
  "unixReviewTime": 1387411200,
  "reviewTime": "12 19, 2013"
}
{
  "reviewerID": "A2IBK009X2XXDH",
  "asin": "9625993428",
  "reviewerName": "Donald G. Bull",
  "helpful": [
    0,
    0
  ],
  "reviewText": "Wouldn't buy this again.  I never really used the product because it didnt fit the phone that well with the phone case on.",
  "overall": 2.0,
  "summary": "mini microphone",
  "unixReviewTime": 1385769600,
  "reviewTime": "11 30, 2013"
}
{
  "reviewerID": "APGS6U5D8YRII",
  "asin": "9625993428",
  "reviewerName": "Eddie",
  "helpful": [
    0,
    0
  ],
  "reviewText": "i bought my mic from crazyfrog, not expecting that great of a mic due to the price. it shipped very fast, and i recieved it in perfect condition. it works just as well as, if not better than, my mic that came with an iphone. it works great with my ipod touch 2nd generation mc model. i would strongly advise anyone to buy this who's looking for a high quality mic at a low price. dont let those bad reviews scare you!! i dont know about the quality from other sellers, but crazyfrog delivered mine in perfect condition. great buy.",
  "overall": 5.0,
  "summary": "Great mic!!!",
  "unixReviewTime": 1279670400,
  "reviewTime": "07 21, 2010"
}
{
  "reviewerID": "AA63DLG8HJ2JQ",
  "asin": "9625993428",
  "reviewerName": "Eisbaer",
  "helpful": [
    1,
    1
  ],
  "reviewText": "I gave this five stars because for the price, this tiny microphone is excellent.  I needed a small unobtrusive mic to record university lectures to my 3rd Generation iPod Touch.  I can report that this mic works perfectly.If you need fancy cut offs, filters, or you expect concert quality results, please go elsewhere.  If you want something that works well for much less than $10, get this mic or get a couple of them.",
  "overall": 5.0,
  "summary": "Better than expected",
  "unixReviewTime": 1362182400,
  "reviewTime": "03 2, 2013"
}
{
  "reviewerID": "AEF7CR8SNCYF2",
  "asin": "9625993428",
  "reviewerName": "Evan R. Tornquist \"e. tornquist\"",
  "helpful": [
    2,
    2
  ],
  "reviewText": "This mic sounds surprisingly great! It picks up a wide range of frequencies very nicely! My only complaint is that it is easy to lose, but there's nothing the manufacturer could do about that.",
  "overall": 5.0,
  "summary": "great quality",
  "unixReviewTime": 1282262400,
  "reviewTime": "08 20, 2010"
}
{
  "reviewerID": "A353N8AMEU296G",
  "asin": "9625993428",
  "reviewerName": "Forznoles \"forznoles\"",
  "helpful": [
    1,
    1
  ],
  "reviewText": "I purchased from 24hourdispatch-Global and it arrived quickly.  The microphone was readily accepted by my iPod touch 3G and allows me to make Voice Memos.  I also tried it for a Skype call and it works!  Note other reviewers have noted you can't both have it in the iPod touch to use as a microphone and hear sound from the speakers - this is a limitation of the iPod touch, and I refuse to give this item a negative review based on the limitations of the iPod touch like so many others have.  You CAN use it to make a Skype call, and both speak into the microphone and hear through the speakers if you set the call to \"speaker,\" either when making or receiving a call.  It's about the size of a very large pill.  I'm very pleased with the seller and the item.",
  "overall": 5.0,
  "summary": "Works with iPod Touch 3G for Voice Memos, Skype Calls",
  "unixReviewTime": 1280707200,
  "reviewTime": "08 2, 2010"
}
{
  "reviewerID": "AU9BPT3Y3K6J4",
  "asin": "9625993428",
  "reviewerName": "G. L. Beebe",
  "helpful": [
    0,
    0
  ],
  "reviewText": "Small, compact, easy to carry around.  Followed the instructions and it worked perfectly.  It's not a broadcast quality microphone, but for everyday voice use it's a great, portable solution.",
  "overall": 5.0,
  "summary": "Does just what it says...",
  "unixReviewTime": 1284681600,
  "reviewTime": "09 17, 2010"
}
{
  "reviewerID": "A21RO7OWHHHUOK",
  "asin": "9625993428",
  "reviewerName": "isaac",
  "helpful": [
    0,
    0
  ],
  "reviewText": "Not as good as the built in mic of my Nexus 4, which I was looking to improve. There's some static on all recordings, and I'm not sure what to do about it. It was cheap, so I'm not too broken hearted about it...",
  "overall": 2.0,
  "summary": "Not better than Nexus 4 internal mic.",
  "unixReviewTime": 1384387200,
  "reviewTime": "11 14, 2013"
}
{
  "reviewerID": "A1RHVVY6U02LN2",
  "asin": "9625993428",
  "reviewerName": "J. Washington \"Mrs. J.W\"",
  "helpful": [
    0,
    0
  ],
  "reviewText": "When I bought my Itouch a few years back, I didnt like the fact that it had no mic.  So I started doing some searching here on amazon.com and I found one and still have it today.  i was able to PTT ( PRESS TO TALK) LIKE A WALKIE TALKIE AND OTHER stuff. I like it.",
  "overall": 5.0,
  "summary": "works just fine",
  "unixReviewTime": 1359504000,
  "reviewTime": "01 30, 2013"
}
{
  "reviewerID": "A34WISS43CVLDP",
  "asin": "9625993428",
  "reviewerName": "k.a.",
  "helpful": [
    0,
    0
  ],
  "reviewText": "...you must unplug the microphone unit to hear any replay/sounds.  I'll hack it in the future in order to allow sounds while it's plugged in.",
  "overall": 4.0,
  "summary": "Works on 2nd gen iTouch, however...",
  "unixReviewTime": 1326067200,
  "reviewTime": "01 9, 2012"
}
{
  "reviewerID": "A2IN1WZFQAC298",
  "asin": "9625993428",
  "reviewerName": "kc \"kc\"",
  "helpful": [
    0,
    0
  ],
  "reviewText": "Didn't work on my iPhone or iPods. Loved that it is compact. Wasn't out much money luckily. Do not recommend.",
  "overall": 1.0,
  "summary": "Waste of money.",
  "unixReviewTime": 1386374400,
  "reviewTime": "12 7, 2013"
}
{
  "reviewerID": "A1FQUFDI4Y67I2",
  "asin": "9625993428",
  "reviewerName": "Mar",
  "helpful": [
    0,
    0
  ],
  "reviewText": "This an awesome product.  It was cheap and works well.  I use it to record lectures in college so I can listen to them again.",
  "overall": 4.0,
  "summary": "Awesome Microphone",
  "unixReviewTime": 1404345600,
  "reviewTime": "07 3, 2014"
}
{
  "reviewerID": "A2L5YC5Z8JD34M",
  "asin": "9625993428",
  "reviewerName": "Michelle Garrett",
  "helpful": [
    0,
    0
  ],
  "reviewText": "It works perfect. The only thing is it is so small. lol. like I think I have seriously swallowed medications larger than this device. Good item. Would recomend to anyone.",
  "overall": 5.0,
  "summary": "So tiny",
  "unixReviewTime": 1364515200,
  "reviewTime": "03 29, 2013"
}
{
  "reviewerID": "A1DF5D8N00SQR0",
  "asin": "9625993428",
  "reviewerName": "My open clip",
  "helpful": [
    0,
    0
  ],
  "reviewText": "I love this mic it works on itouch 3generation 8 gb so well. I love it too much and wat a money saver too . Nothing more to say but to order it soon!!!",
  "overall": 5.0,
  "summary": "Mic",
  "unixReviewTime": 1284508800,
  "reviewTime": "09 15, 2010"
}
{
  "reviewerID": "A133Z74IY6J9D7",
  "asin": "9625993428",
  "reviewerName": "NEW JERSEY WOMAN",
  "helpful": [
    4,
    5
  ],
  "reviewText": "Received this item today.  Plugged it in and thought that I should have read the reviews first. But there were also alot of good reviews.  So, I tried to think what was going on, plugging it in first it said \"no microphone\" when I went to my recording app.  I don't know if it did not go in all the way with the case on my Ipod, but I had to charge it and when I tried again with the case off, it did work.  IN ORDER TO LISTEN TO WHAT YOU HAVE RECORDED, YOU HAVE TO DISCONNECT THE MICROPHONE. Made sure it was pushed in all the way when I put the case back on.",
  "overall": 5.0,
  "summary": "THOUGHT I WAS RIPPED OFF TOO!!!",
  "unixReviewTime": 1302912000,
  "reviewTime": "04 16, 2011"
}
{
  "reviewerID": "A1MGS94AG7NSZL",
  "asin": "9625993428",
  "reviewerName": "Nick",
  "helpful": [
    0,
    0
  ],
  "reviewText": "This is a very good seller. The product arrived exactly on the estimated date of arrival. The only problem I have is that the mic has no speakers, so you need to unplug it to listen to the ipod again.",
  "overall": 5.0,
  "summary": "Great Service",
  "unixReviewTime": 1289260800,
  "reviewTime": "11 9, 2010"
}
{
  "reviewerID": "AIGZW643OAYGT",
  "asin": "9625993428",
  "reviewerName": "raj33v",
  "helpful": [
    0,
    0
  ],
  "reviewText": "useless piece of device for a device that already has a mic... the performance is very average...!!! looks smooth tho.",
  "overall": 1.0,
  "summary": "useless.",
  "unixReviewTime": 1377302400,
  "reviewTime": "08 24, 2013"
}
{
  "reviewerID": "AQQA2GTK78VI2",
  "asin": "9625993428",
  "reviewerName": "R. Stewart",
  "helpful": [
    0,
    0
  ],
  "reviewText": "I thought I could use something like this to enhance the tiny pin hole mic on my tablet but this thing is actually worse.  When doing a test recording the pin hole mic on the tablet was 5-6 times as loud during playback and the fidelity of the sound was higher from the built in tablet mic.  About the only way to could get anything to even register was to speak directly into the holes on this mic from an inch away.",
  "overall": 1.0,
  "summary": "Only an improvement over no microphone at all",
  "unixReviewTime": 1309824000,
  "reviewTime": "07 5, 2011"
}
{
  "reviewerID": "A2ZT1CSHU62UOL",
  "asin": "9625993428",
  "reviewerName": "SAH",
  "helpful": [
    0,
    0
  ],
  "reviewText": "It does not work. When you plug it in, it disables the speakers and then the iPod is practically silent. Not a good idea.",
  "overall": 1.0,
  "summary": "Does not work with my iPod Touch 3G",
  "unixReviewTime": 1280534400,
  "reviewTime": "07 31, 2010"
}
{
  "reviewerID": "A3CQUQ28OKOMMT",
  "asin": "9625993428",
  "reviewerName": "Shamoka",
  "helpful": [
    0,
    1
  ],
  "reviewText": "I needed this for my iPod Touch and also ordered a few extras because I lose little things easily. This mic has provided much use and definitely of better quality than I was expecting it to be. I've even recommended this to a couple of friends.",
  "overall": 5.0,
  "summary": "Awesome Mini Mic",
  "unixReviewTime": 1288569600,
  "reviewTime": "11 1, 2010"
}
{
  "reviewerID": "A2CX79FL19TP46",
  "asin": "9625993428",
  "reviewerName": "Silver",
  "helpful": [
    1,
    1
  ],
  "reviewText": "sensitivity is slightly on the low side...records loud static noise every three seconds...otherwise, it's a good product...",
  "overall": 4.0,
  "summary": "pretty good...",
  "unixReviewTime": 1282435200,
  "reviewTime": "08 22, 2010"
}
{
  "reviewerID": "A3QHAJV442WLZ2",
  "asin": "9625993428",
  "reviewerName": "S. McAtee",
  "helpful": [
    1,
    1
  ],
  "reviewText": "This item works with an I-phone 4, 4s and a Samsung Galaxy S3.  The microphone picks up sound 10 time better than the built in phone mic.  The shipping time was a little long but that is clearly stated when you purchase it.  This lets you use your phone as a digital recorder.  I will buy another one",
  "overall": 4.0,
  "summary": "Works Great",
  "unixReviewTime": 1369267200,
  "reviewTime": "05 23, 2013"
}
{
  "reviewerID": "ACSCECQJQNT5I",
  "asin": "9625993428",
  "reviewerName": "TimTime",
  "helpful": [
    1,
    1
  ],
  "reviewText": "As a microphone this thing works fine. However if you are trying to turn your itouch into a skype phone forget it as the volume on itouch just isn't loud enough. I have found out that the only way to use the itouch as s skype phone is to use the headphones that include a mic. And then if you have skype in, forget it because you will never hear the thing ring. But the mic works and it is little money.",
  "overall": 2.0,
  "summary": "Works for recording just fine but not for skype",
  "unixReviewTime": 1278892800,
  "reviewTime": "07 12, 2010"
}
{
  "reviewerID": "A2I7TWQ62H1VF",
  "asin": "9625993428",
  "reviewerName": "Virginia",
  "helpful": [
    0,
    0
  ],
  "reviewText": "Good product does the job. Good price. It has a carrying case. I used for the ipod  does a good job.",
  "overall": 5.0,
  "summary": "Black Mini Microphone for Iphone",
  "unixReviewTime": 1358121600,
  "reviewTime": "01 14, 2013"
}
{
  "reviewerID": "A2QJ3GNQ3SYKCQ",
  "asin": "9625993428",
  "reviewerName": "Yudong Hao",
  "helpful": [
    0,
    0
  ],
  "reviewText": "I plugged it in and it worked. It is small, but taking it with you is a challenge. How about making it into a key chain?",
  "overall": 4.0,
  "summary": "It works on my iPod Touch 3G",
  "unixReviewTime": 1292630400,
  "reviewTime": "12 18, 2010"
}
