{"reviewerID": "A2PGE5RPSV9BFH", "asin": "9876050621", "reviewerName": "Al Perilla", "helpful": [0, 0], "reviewText": "SD Ultra Micro SDXC card has worked without flaw so far.  It's been trouble-free up to this point in transfering and managing all my audio files (~29GB) from my HP laptop to my Samsung Note 10.1 2014 Edition.  I've also purchased compatible SD micro cards for my Samsung Galaxy III cell phones which have worked out better than the Kingston cards that I had originally purchased.", "overall": 5.0, "summary": "SanDisk Outstanding Performance", "unixReviewTime": 1401148800, "reviewTime": "05 27, 2014"}
{"reviewerID": "A1R494W7UBXL90", "asin": "9876050621", "reviewerName": "Edith Reginaldo", "helpful": [0, 0], "reviewText": "i like it, but a little expensive compared to others i saw online after purchasing.  Other than that, it's good.", "overall": 4.0, "summary": "i like it", "unixReviewTime": 1403222400, "reviewTime": "06 20, 2014"}
{"reviewerID": "A2A28DJDS6LEHP", "asin": "9876050621", "reviewerName": "Gadget Nut \"RichR\"", "helpful": [0, 0], "reviewText": "I bought this on March 4th, 2014. Suddenly even thought the Storage in settings showed the card with used and free space, no app could find any files on it. Had to dismount, remove it and reinsert it for it to work, BUT it is erratic! While in the middle of playing mp3s on it, all the files disappeared.. This is happening over and over. Very disappointing!", "overall": 1.0, "summary": "Worked for about 50 days.", "unixReviewTime": 1398384000, "reviewTime": "04 25, 2014"}
{"reviewerID": "A2I9X30JGIAG", "asin": "9876050621", "reviewerName": "Mstay1 \"mstay1\"", "helpful": [0, 0], "reviewText": "I had a couple of problems with having to reset my device so it could read the sd card before.  I like to save any applications I can to it to save room on my device.  Worked great for a couple of months after that.  Then since yesterday, it just stopped reading and started saying damaged card and try to format.  I formatted it, and it still wont read the sd card.  This was a horrible waste of my money.  I am very upset.", "overall": 1.0, "summary": "Very dissapointed", "unixReviewTime": 1398643200, "reviewTime": "04 28, 2014"}
{"reviewerID": "A9D6Y6RL8ILK4", "asin": "9876050621", "reviewerName": "The Dude", "helpful": [0, 0], "reviewText": "Works as described. Have not had an issue with my Samsung Galaxy Note 10.1 2014. There was a surprise when it arrived though: there was an SD adapter card with it. Did not read that in the description when I ordered the card.", "overall": 5.0, "summary": "Mini SD with a bonus", "unixReviewTime": 1395446400, "reviewTime": "03 22, 2014"}
